main.floors.MT0=
{
    "floorId": "MT0",
    "title": "正面",
    "name": "正面",
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "ground",
    "images": [
        {
            "name": "floor_texture.jpg",
            "x": 0,
            "y": 0,
            "w": 416,
            "h": 416,
            "sx": 0,
            "sy": 0,
            "canvas": "bg"
        }
    ],
    "ratio": 1,
    "map": [
    [  0,221, 81, 32, 81,  0,204,  0, 81, 32, 81,221,  0],
    [ 81,  0, 27,  1,  1,  1,  0,  1,  1,  1, 28,  0, 81],
    [  1, 21,  1,  1, 31, 82,202, 82, 31,  1,  1, 21,  1],
    [  1,  1, 31,  1, 31,  1, 21,  1, 31,  1, 31,  1,  1],
    [ 81,203, 81, 31, 23,  1,202,  1, 47, 31, 81,203, 81],
    [  1, 32,  1,  1,  1,124,233,129,  1,  1,  1, 32,  1],
    [  0,  0,219, 21,201,275,  0,248,201, 21,219,  0,  0],
    [203,  1,  1,  1,  1,126,250,125,  1,  1,  1,  1,203],
    [ 27,  0, 28,  0, 29,  1,202,  1, 33,  0, 34,  0, 32],
    [202,  1,  1,  1,  0,  1, 21,  1,  0,  1,  1,  1,202],
    [ 29, 34, 29,  1,  1, 21, 83, 32,  1,  1, 29, 34, 29],
    [ 81, 29, 22,  1, 32,163, 27,163, 32,  1, 22, 29, 81],
    [  0,221,  1, 32, 31, 81,  0, 81, 31, 32,  1,221,  0]
],
    "firstArrive": [
        "c键打开3d模型地图，点击立方体的图标也能打开。\n手机端按虚拟键盘图标，可以用方向键进行移动。"
    ],
    "parallelDo": "",
    "events": {
        "7,7": [
            "本塔为实验ai造塔能力边界的作品，bug很多，遇到了可以进行反馈，但不一定能保证修复"
        ],
        "7,5": [
            "机关门事件开启条件如下：\n顶面击败所有骷髅士兵开启机关门\n底面击败所有初级法师和石头人开启机关门\n左面击败所有初级卫兵开启机关门\n右面击败所有初级卫兵开启机关门\n追猎，阻击，领域，激光，夹击，破墙镐，炸弹，开门，全都能跨层生效\n伯伯是加6防减10攻，商人是加6攻减10防"
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [

],
    "fgmap": [

],
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {}
}