main.floors.MT0=
{
    "floorId": "MT0",
    "title": "正面",
    "name": "正面",
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "ground",
    "images": [],
    "ratio": 1,
    "map": [
    [  0,221, 81, 32, 81,  0,204,  0, 81, 32, 81,221,  0],
    [ 81,  0, 27,  1,  1,  1,  0,  1,  1,  1, 28,  0, 81],
    [  1, 21,  1,  1, 31, 82,202, 82, 31,  1,  1, 21,  1],
    [  1,  1, 31,  1, 31,  1, 21,  1, 31,  1, 31,  1,  1],
    [ 81,203, 81, 31, 23,  1,202,  1, 47, 31, 81,203, 81],
    [  1, 32,  1,  1,  1,  1,248,  1,  1,  1,  1, 32,  1],
    [  0,  0,219, 21,201,275,  0,233,201, 21,219,  0,  0],
    [203,  1,  1,  1,  1,  1,250,  1,  1,  1,  1,  1,203],
    [ 27,  0, 28,  0, 29,  1,202,  1, 33,  0, 34,  0, 32],
    [202,  1,  1,  1,  0,  1, 21,  1,  0,  1,  1,  1,202],
    [ 29, 34, 29,  1,  1, 21, 83, 32,  1,  1, 29, 34, 29],
    [ 81, 29, 22,  1, 32,163, 27,163, 32,  1, 22, 29, 81],
    [  0,221,  1, 32, 31, 81,  0, 81, 31, 32,  1,221,  0]
],
    "firstArrive": [
        "c键打开3d模型地图，点击传送门的图标也能打开"
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [

],
    "fgmap": [

],
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {}
}