main.floors.MT5=
{
    "floorId": "MT5",
    "title": "底面",
    "name": "底面",
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "ground",
    "images": [
        {
            "name": "floor_texture.jpg",
            "x": 0,
            "y": 0,
            "w": 416,
            "h": 416,
            "sx": 0,
            "sy": 0,
            "canvas": "bg"
        }
    ],
    "ratio": 1,
    "map": [
    [  0,221,161,162,161,  0, 49,  0,162,161,162,221,  0],
    [ 34, 81, 81, 81,  1,  1,  0,  1,  1, 81, 81, 81, 34],
    [ 81, 81, 21,  0, 34, 82, 31, 82, 34,  0, 21, 81, 81],
    [164,279,217, 28,  1,221,215,221,  1, 28,215,267,163],
    [164,279, 28,122, 33,  1,  0,  1, 33, 83, 28,267,163],
    [164,279,217,  1,217,  1, 34,  1,215,  1,215,267,163],
    [164,279,  0,  1,  0,  1,162,  1, 28,  1,  0,267,163],
    [164,279, 28,  1, 36,  1,  0,  1,  0,  1, 28,267,163],
    [164,279, 21, 83,  0,  1, 22,  1, 47,122, 21,267,163],
    [164, 82,217,  0,225, 32,217, 32,225,  0,215, 82,163],
    [ 81,279, 33, 28,  0, 82, 32, 82,  0, 28, 22,267, 81],
    [ 34, 81, 81,  0, 81, 81, 32, 81, 81,  0, 81, 81, 34],
    [  0,221,122, 85,122, 85, 83, 85,122, 85,122,221,  0]
],
    "firstArrive": [
        "底面击败本层所有初级法师和石头人，将会开启底面所有机关门"
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [

],
    "fgmap": [

],
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {}
}